#include "CharaStatus.h"

const CharaStatus PLAYER_STATUS[PLAYER_LEVEL_MAX] =
{
	// 後で変更する
	// プレイヤーのステータスごとのテーブル
	// レベル		HP		攻撃力			防御		移動速度			スタミナ
	{1,				10,			2,			  3,			1.0f,				100},
	{2,				20,			2,			  3,			1.2f,				100},
	{3,				30,			2,			  3,			1.2f,				100},
	{4,				40,			2,			  3,			1.2f,				100},
	{5,				50,			2,			  3,			1.2f,				100},
	{6,				60,			2,			  3,			1.2f,				100},
	{7,				70,			2,			  3,			1.2f,				100},
	{8,				80,			2,			  3,			1.2f,				100},
	{9,				90,			2,			  3,			1.2f,				100},
	{10,		   100,			2,			  3,			1.3f,				100},
};